{"config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 3], "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 3], "name": "input_2"}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"layers": [{"config": {"bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "batch_input_shape": [null, 128, 128, 3], "name": "conv2d", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "kernel_size": [10, 10], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "dtype": "float32", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization", "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "kernel_size": [7, 7], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "dtype": "float32", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization_1", "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "dtype": "float32", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization_2", "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "dtype": "float32", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [3], "name": "batch_normalization_3", "beta_regularizer": null, "momentum": 0.99, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 4096, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential"}, "name": "sequential", "class_name": "Sequential", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"config": {"trainable": true, "function_type": "lambda", "module": "__main__", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAwAAAAcAAABDAAAAc0QAAAB8AABkAQAZfAAAZAIAGQJ9AQB9AgB0AABqAQB0AABq\nAgB0AABqAwB8AQB8AgAYgwEAZAMAZAIAZAQAZAUAgwECgwEAUykGTukAAAAA6QEAAADaBGF4aXPa\nCGtlZXBkaW1zVCkE2gFL2gRzcXJ02gNzdW3aBnNxdWFyZSkD2gV2ZWN0c9oBeNoBeakAcgwAAAD6\nKUQ6L01ML09uZV9zaG90X2RldGVjdGlvbi9zaWFtZXNlX21vZGVsLnB52hJldWNsaWRlYW5fZGlz\ndGFuY2U5AAAAcwQAAAAAARUB\n", null, null], "output_shape_module": null, "name": "lambda", "arguments": {}, "output_shape": null, "dtype": "float32"}, "name": "lambda", "class_name": "Lambda", "inbound_nodes": [[["sequential", 1, 0, {}], ["sequential", 2, 0, {}]]]}, {"config": {"bias_constraint": null, "trainable": true, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 1, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["lambda", 0, 0, {}]]]}], "name": "model"}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}